[
    {
        "id": "1gs2bab",
        "title": "Boss wants to get back on Prime",
        "content": "We ship from the Northeast, handling 3,500-4,000 orders six days a week during peak season (April to June). These may include oversized or non-case shipments, so we would require someone to ship using our accounts. We aim to cover as much of Zone 4 as possible and are seeking a 3PL partner with a focus on the West (possibly Reno), Texas (like OKC), and the Southeast. Any suggestions?",
        "subreddit": "logistics",
        "author": "silver_sAUsAGes",
        "upvotes": 3,
        "category": "Third-Party Logistics (3PL)",
        "created_utc": "2024-11-15T17:55:34+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gs2bab/boss_wants_to_get_back_on_prime/",
        "comments": [
            {
                "author": "fleetwood96",
                "body": "Followed up with a DM!",
                "upvotes": 1,
                "created_utc": "2024-11-15T18:05:42+00:00"
            },
            {
                "author": "KEIGHWAR",
                "body": "Dm’d",
                "upvotes": 1,
                "created_utc": "2024-11-15T18:54:59+00:00"
            },
            {
                "author": "Mirimirii",
                "body": "If you are looking in Midwest, I can help",
                "upvotes": 1,
                "created_utc": "2024-11-15T21:58:33+00:00"
            },
            {
                "author": "Comedy1010",
                "body": "DM’d. Based in reno. Warehouse, capacity, let me know!",
                "upvotes": 1,
                "created_utc": "2024-11-15T22:33:20+00:00"
            },
            {
                "author": "RetroShip",
                "body": "We have one location (AZ), but I own and operate Retroship.\n\nYou are welcome to use your own carriers or ours, whatever saves you the most in shipping (we have fantastic rates with UPS for larger shipments).",
                "upvotes": 1,
                "created_utc": "2024-11-15T23:55:08+00:00"
            }
        ],
        "_id": "67385d48c429ce551fa7426e"
    },
    {
        "id": "1grvuzl",
        "title": "3PL Question",
        "content": "I need a reputable 3PL company for my online clothing brand. Ideally, it should be based in the US and offer international shipping. I typically have 200-1000 items with about 15-20 different SKUs. My manufacturer will send items in bulk for them to store and ship as required. What are some recommended options?",
        "subreddit": "logistics",
        "author": "InternationalSkin302",
        "upvotes": 9,
        "category": "Third-Party Logistics (3PL)",
        "created_utc": "2024-11-15T13:02:56+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1grvuzl/3pl_question/",
        "comments": [
            {
                "author": "pleaseleevmealone",
                "body": "Oh man, your poor DMs. \n\nThe biggest (most expensive) players in the game are Geodis and Radial. You are probably looking for a bit smaller based on your volume. 3PLs price based on storage, pick and pack, and shipping. In my experience ShipBob and Cart.com are hit and miss by location. Stord is a shitshow, but may be a good fit for a smaller brand like yours. They just bought some excellent pitney bowes facilities. Pick a provider based on proximity to your average customer, tour the facility and ask lots of questions about their processes. Good luck!",
                "upvotes": 5,
                "created_utc": "2024-11-15T16:10:06+00:00"
            },
            {
                "author": "SHFJ4-4",
                "body": "Warehut is probably your best option.",
                "upvotes": 2,
                "created_utc": "2024-11-16T03:11:34+00:00"
            },
            {
                "author": "freightforwardus",
                "body": "So what exactly are you looking for the 3PL to do? Warehousing, shipping, and international? Would the 3PL be doing pick and pack at the warehouse? Are these coming/going palletized? Couple different things to think about when searching for a 3PL",
                "upvotes": 1,
                "created_utc": "2024-11-15T15:01:29+00:00"
            },
            {
                "author": "dskot",
                "body": "AMZ Worldwide",
                "upvotes": 1,
                "created_utc": "2024-11-15T19:03:55+00:00"
            },
            {
                "author": "Tall_Category_304",
                "body": "Austin? That you?",
                "upvotes": 1,
                "created_utc": "2024-11-15T21:32:40+00:00"
            }
        ],
        "_id": "67385d48c429ce551fa7426f"
    },
    {
        "id": "1goyvia",
        "title": "Need Suggestion regarding API integration and Warehouse Management Software",
        "content": "Hi everyone, I've recently started as an assistant in the supply team at my new company. We use a basic in-house cloud system for management, which lacks features typical of modern warehouse and inventory software. This limitation puts pressure on our team as we deal with unnecessary daily issues. The corporate office can't replace the system since it's used by other locations. I'm considering integrating an API between our current system and a modern warehouse management solution to allow better communication and information reconciliation. Additionally, we have various unused equipment, such as Android handheld scanners and barcode printers, ordered by a previous employee, but they can't be integrated with our current system. I would appreciate any suggestions on how to address this and recommendations for effective warehouse management or inventory tracking software that could work with our equipment. Thank you!",
        "subreddit": "warehousing",
        "author": "atomic_momo",
        "upvotes": 2,
        "category": "Just-In-Time Inventory",
        "created_utc": "2024-11-11T18:12:58+00:00",
        "url": "https://www.reddit.com/r/Warehousing/comments/1goyvia/need_suggestion_regarding_api_integration_and/",
        "comments": [
            {
                "author": "TigerDude33",
                "body": "I don't think ayone would recommend connecting a new WMS to your existing one.  I have never seen this done, and I've been doing this a long time.  You double your support effort, complicate troubleshooting, and have a completely non-standard interface.  You will also find that \"an API' will quickly turn into about 20 API's.  Could you do it?  Sure, it's just time and money.  But you'll never be happy with the results.  And if corporate won't let you replace it, they'll certainly not let you overlay something new on top of it.",
                "upvotes": 1,
                "created_utc": "2024-11-11T18:39:14+00:00"
            },
            {
                "author": "realEVS",
                "body": "Yes, don’t do it, if your current system is unreliable, duplicating and running two in parallel will cause even more issues. \n\nOnly way I can think of is the new WMS will be in charge in your site (including integration of whatever hardware you have) and reporting only must have data (stock value for example) to the original WMS to satisfy whatever company/ business need. But it’s crazy anyway and that’s sounds more like you need to push for company wide change or in-house development of what you already have.",
                "upvotes": 1,
                "created_utc": "2024-11-11T21:29:05+00:00"
            },
            {
                "author": "Old-House2772",
                "body": "Inhouse .. sounds problematic.  \n\nWhile connecting one WMS to another isn't common, it is common to do very similar things.. eg it is typical for a WMS to be connected to a companys base  management system  eg SAP WM or EWM would connect on top of SAP ECC. Likewise you might connect subsystems on top of your WMS for controlling conveyors, voice picking etc.  If your base system is good enough, you could get someone in to assess and quote a voice system or similar to go on top.  All this tends to cost alot, so .. your scale and the size of the problem itself will determine whether it is worth the effort.  A half assed implementation is often worse than doing nothing.",
                "upvotes": 1,
                "created_utc": "2024-11-12T02:22:21+00:00"
            },
            {
                "author": "Skittle_392",
                "body": "Definitely don’t put one on top of the other.   I been designing and architecting warehouses for over 15 years primarily now Blue Yonder and Korber WMS.   \n\nIf you can get the budget and get assistance on defining the project having one site get designed and can setup API to the other warehouses is doable.   But I would not do two WMS for the one site.  \n\nThen you can do a phase approach to bring the other facilities online. \n\nAnd with Korber over last few years their RF session can be ran via android or Apple Store app.   Or use a chrome browser to connect to a web RF session.",
                "upvotes": 1,
                "created_utc": "2024-11-13T05:06:26+00:00"
            }
        ],
        "_id": "67385d48c429ce551fa74270"
    },
    {
        "id": "ftbkhp",
        "title": "Mom and pop 3PL",
        "content": "Given the current situation, many of my clients are asking if I can fulfill their orders. We collaborate with foreign companies selling in our country, and they want to send their inventory for me to ship since Amazon has halted inbound FBA shipments. I can manage this, but my shipping rates with the post office are not competitive with a Canadian 3PL. I prefer to keep this service in-house for my clients. Is it common to send my clients' inventory to a 3PL and then bill them for the costs, similar to a white label arrangement? One client, in particular, ships about 200 units monthly. I would appreciate any insights. Thank you.",
        "subreddit": "3pl",
        "author": "pittapatta1867",
        "upvotes": 8,
        "category": "Third-Party Logistics (3PL)",
        "created_utc": "2020-04-01T23:51:22+00:00",
        "url": "https://www.reddit.com/r/3PL/comments/ftbkhp/mom_and_pop_3pl/",
        "comments": [
            {
                "author": "rspilly",
                "body": "Yes, this is referred to 4PL. \n\nThe 3PL renders the service, and you mark it up or collect a commission. I do this all the time.",
                "upvotes": 5,
                "created_utc": "2020-06-06T00:08:08+00:00"
            },
            {
                "author": "LogisticalSense",
                "body": "If you’re not at least using a parcel consolidation service, you should. It doesn’t require the large volume that this type of service does with DHL/UPS/FedEx. Everything still ships USPS First Class International, but it just takes an extra day or two. We ship a lot of small, lightweight packages and our international shipping rates are less than domestic rates in most cases. \n\nHope this helps!",
                "upvotes": 3,
                "created_utc": "2020-04-02T04:40:23+00:00"
            },
            {
                "author": "seedfs",
                "body": "Yeah, I might be able to assist.  I own SEED Fulfillment ([seedfs.net](https://seedfs.net)).  You can resale our services and that is somewhat going on all of the time as a few large fulfillment companies utilize a network of smaller facilities and do not have any fulfillment centers on their own.  They sell fulfillment, but yet basically white label to other companies.   Are you in Canada or the US?  We're based in North Carolina.",
                "upvotes": 2,
                "created_utc": "2020-04-06T15:38:42+00:00"
            },
            {
                "author": "UpperLogistics",
                "body": "BOUTIQUE warehouse in MIAMI,FL offering:  \n\\#3PL #FULFILLMENT #WAREHOUSE #STORAGE #IMPORT #EXPORT #CUSTOMS  \nwww.upperlogistics.com",
                "upvotes": 2,
                "created_utc": "2023-05-11T20:44:25+00:00"
            },
            {
                "author": "high_consideration88",
                "body": "How do you find clients",
                "upvotes": 2,
                "created_utc": "2024-04-04T03:34:11+00:00"
            }
        ],
        "_id": "67385d48c429ce551fa74271"
    },
    {
        "id": "1grwd1h",
        "title": "Help me decide - SCM study to take",
        "content": "Hello! I graduated from IE and have three years of experience as an inventory analyst in supply chain management. My current employer offers scholarships for further education, and I want to take advantage of this. As far as I know, there's no bond requirement. I'm seeking your opinions on what studies would be beneficial. I'm not aiming for a promotion, but I want to upskill for professional growth and future earning potential. Here are the factors I'm considering: 1. Time - a Master's typically takes two years, while certifications can take 3-6 months. 2. Type of Program: Master's in Engineering Management, SCM, or Finance; Certifications in Six Sigma, Data Analytics, or Demand Planning. 3. Format: Hybrid (onsite/virtual) 4. Possible capstone project with my employer to apply what I learn. Could you share your pros and cons? Any suggestions would be greatly appreciated!",
        "subreddit": "supplychainlogistics",
        "author": "nanamiiiiiiii",
        "upvotes": 1,
        "category": "Eco-Friendly",
        "created_utc": "2024-11-15T13:29:43+00:00",
        "url": "https://www.reddit.com/r/SupplyChainLogistics/comments/1grwd1h/help_me_decide_scm_study_to_take/",
        "comments": [],
        "_id": "67385d48c429ce551fa74272"
    },
    {
        "id": "1g0dr6f",
        "title": "Descartes' 2024 Study: How Sustainable Delivery is Shaping Logistics 🚚",
        "content": "Hello everyone! At Descartes, we’ve been researching trends in home delivery and just completed our 2024 Home Delivery Sustainability Study. Given the shifts in logistics and the global economy, we examined how consumer preferences for sustainability impact last-mile delivery. 57% of consumers seek sustainable delivery options, and an impressive 99% are willing to take further steps to lower their carbon footprint. However, 89% indicated that economic factors like inflation influence their ability to pay more for eco-friendly delivery. Additionally, 37% now evaluate convenience and sustainability equally when selecting delivery methods. A significant trend is the emergence of green delivery slots, which consolidate multiple orders into fewer trips to decrease emissions and costs; 56% of respondents are open to this approach. For last-mile providers, this could be a vital innovation for both environmental benefits and better cost management. What are your thoughts? How is the last-mile sector adapting to sustainability goals amid cost challenges? Are there any new technologies or processes aiding you in balancing both? We’d love to hear your insights! 🙌 If you’re interested in the complete study, you can find it here:",
        "subreddit": "lastmiledelivery",
        "author": "RMTDescrates",
        "upvotes": 2,
        "category": "Eco-Friendly",
        "created_utc": "2024-10-10T07:59:21+00:00",
        "url": "https://www.reddit.com/r/LastMileDelivery/comments/1g0dr6f/descartes_2024_study_how_sustainable_delivery_is/",
        "comments": [],
        "_id": "67385d48c429ce551fa74273"
    },
    {
        "id": "1ex0n81",
        "title": "Starting a Last Mile Delivery business, where's the best place to do networking and learn from other couriers about the business best practices?",
        "content": "I'm launching a delivery business in San Antonio and want to connect with people nationwide to learn from them and enhance my business model. Any tips and tricks are also appreciated!",
        "subreddit": "lastmiledelivery",
        "author": "Beneficial-Lemon4546",
        "upvotes": 3,
        "category": "Last Mile Innovation",
        "created_utc": "2024-08-20T16:51:18+00:00",
        "url": "https://www.reddit.com/r/LastMileDelivery/comments/1ex0n81/starting_a_last_mile_delivery_business_wheres_the/",
        "comments": [],
        "_id": "67385d48c429ce551fa74274"
    },
    {
        "id": "1gsc9ry",
        "title": " \"Dynamic Inventory Management System (IMS) in Excel\"",
        "content": "Tired of complex inventory management? Streamline control and gain real-time insights with our advanced Inventory Management System (IMS) in Excel. Designed for modern businesses, our IMS provides a complete solution for efficient product tracking, easy updates, and valuable analytics. Key Features: ✔️ Auto-generated and updated inventory ledger ✔️ Search functionality ✔️ Product add/edit feature ✔️ On-hand inventory and stock take reports in PDF ✔️ Dashboard insights ✔️ User entry logs Why Choose Me: ✔️ Over 4 years of experience in creating dynamic business management modules ✔️ Certified Financial Consultant ✔️ Accurate and actionable inventory models guaranteed ✔️ Commitment to client deadlines and requirements ✔️ 24/7 support Contact Me: Don't let inventory issues slow you down—achieve efficiency, accuracy, and growth. Transform your inventory management with Dynamic IMS. I'm here to assist you at every step.",
        "subreddit": "inventorymanagement",
        "author": "MZG1988",
        "upvotes": 1,
        "category": "Just-In-Time Inventory",
        "created_utc": "2024-11-16T01:29:53+00:00",
        "url": "https://www.reddit.com/r/InventoryManagement/comments/1gsc9ry/dynamic_inventory_management_system_ims_in_excel/",
        "comments": [],
        "_id": "67385d48c429ce551fa74275"
    }
]